In [2]:
# Dependencies 
import pandas as pd

In [3]:
# Read csv files into pandas dataframes to check if certain columns are unique 

dept_df = pd.read_csv('departments.csv')
dept_emp_df = pd.read_csv('dept_emp.csv')
dept_manager_df = pd.read_csv('dept_manager.csv')
employees_df = pd.read_csv('employees.csv')
salaries_df = pd.read_csv('salaries.csv')
titles_df = pd.read_csv('titles.csv')

In [22]:
# Defining function to check uniqueness of columns
def unique_check(column):
    if len(column) == len(column.unique()):
        print('This column contains unique values.')
    else:
        print('This column does not contain unique values.')

### Department Table

In [23]:
dept_df.head()

  dept_no        dept_name
0    d001        Marketing
1    d002          Finance
2    d003  Human Resources
3    d004       Production
4    d005      Development

In [24]:
unique_check(dept_df.dept_no)

This column contains unique values.

### Department Employment Data

In [27]:
dept_emp_df.head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

In [25]:
unique_check(dept_emp_df.emp_no)

This column does not contain unique values.

In [6]:
dept_manager_df.head()

  dept_no  emp_no   from_date     to_date
0    d001  110022  1985-01-01  1991-10-01
1    d001  110039  1991-10-01  9999-01-01
2    d002  110085  1985-01-01  1989-12-17
3    d002  110114  1989-12-17  9999-01-01
4    d003  110183  1985-01-01  1992-03-21

In [28]:
unique_check(dept_manager_df.emp_no)

This column contains unique values.

In [7]:
employees_df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [29]:
unique_check(employees_df.emp_no)

This column contains unique values.

In [8]:
salaries_df.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10002   65828  1996-08-03  1997-08-03
2   10003   40006  1995-12-03  1996-12-02
3   10004   40054  1986-12-01  1987-12-01
4   10005   78228  1989-09-12  1990-09-12

In [31]:
unique_check(salaries_df.emp_no)

This column contains unique values.

In [9]:
titles_df.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [32]:
unique_check(titles_df.emp_no)

This column does not contain unique values.